import streamlit as st
import pandas as pd
import numpy as np

df = pd.DataFrame({'latitude':[22.811942,22.824234,22.814160,22.809728,22.813826,22.759869],
'longitude':[108.392788,108.318291,108.321510,108.324614,108.318945,108.320104]})
     
st.subheader('南宁美食地图🌏')
st.map(df)


data3 = {
    '店名':['一点点','CHAGEE霸王茶姬','海底捞火锅','舒记老友粉','煲掌柜·明火煲仔饭','爱民螺蛳粉'],
    '评分':[1,2,3,4,5,6],

}

st.subheader("⭐️餐厅评分")

df = pd.DataFrame(data3)

index = pd.Series([1,2,3,], name='序号')

st.bar_chart(df, x='店名')



data2 =  {
 
    '月份':[1,2,3,4,5,6,7,8,9,10,11,12],
    '一点点':[60, 75, 95,45,68,97,64,64,13,70,80,70],
    'CHAGEE霸王茶姬':[30, 40, 55, 95,56,54,30,45,89,12,78,51],
    '海底捞火锅':[30, 60, 70,30, 63, 55, 45,56,54,52,45,89],
    '舒记老友粉':[50, 90, 95,30, 63, 70,41, 63, 39, 45,78,54],
    '煲掌柜·明火煲仔饭':[30, 70, 85,30, 63, 75,90, 63, 26, 45,23,54],
    '爱民螺蛳粉':[40, 60, 95,30, 70, 45,30, 63,45,90, 86, 26,]
}

st.subheader("💰不同餐厅类型价格")

df = pd.DataFrame(data2)

index = pd.Series([1,2,3,4,5,6,7,8,9,10,11,12], name='序号')

st.line_chart(df, x='月份')


# 定义数据,以便创建数据框
data = {
    '时段':[10,11,12],
    '一点点':[60, 75, 95],
    'CHAGEE霸王茶姬':[30, 40, 55],
    '海底捞火锅':[30, 60, 70],
    '舒记老友粉':[50, 90, 95],
    '煲掌柜·明火煲仔饭':[30, 70, 85],
    '爱民螺蛳粉':[40, 60, 95]
}
st.subheader("🕗用餐高峰时段")
df = pd.DataFrame(data)
index = pd.Series([1, 2, 3,], name='序号')
df.index = index
st.area_chart(df, x='时段')


st.subheader('餐厅详情')
st.text('选择餐厅查看详情')





